#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jyablonski_prac/github-terraform-demo/runs/run-rpptZFnaVV3LyJX9

Waiting for the plan to start...

Terraform v1.1.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
snowflake_database.NBA_ELT_DB: Refreshing state... [id=NBA_ELT_DB]
snowflake_schema.NBA_AIRFLOW_QA: Refreshing state... [id=NBA_ELT_DB|NBA_AIRFLOW_QA]
snowflake_schema.NBA_AIRFLOW: Refreshing state... [id=NBA_ELT_DB|NBA_AIRFLOW]
snowflake_schema.TEST_SCHEMA: Refreshing state... [id=NBA_ELT_DB|TEST_SCHEMA]
aws_key_pair.airflow_ec2_key: Refreshing state... [id=airflow-ec2-key]
aws_iam_user.jacobs_github_user: Refreshing state... [id=jacobs-github-ci]
aws_cloudwatch_event_rule.every_15_mins: Refreshing state... [id=python_scheduled_task_test]
aws_iam_user.jacobs_terraform_user: Refreshing state... [id=jacobs-terraform-user]
aws_iam_role.jacobs_ecs_ecr_role: Refreshing state... [id=jacobs_ecs_ecr_role]
aws_s3_bucket.jacobs_bucket_tf: Refreshing state... [id=jacobsbucket97]
aws_cloudwatch_log_group.aws_ecs_logs: Refreshing state... [id=jacobs_ecs_logs]
aws_instance.jacobs_ec2_airflow: Refreshing state... [id=i-021c31107d920c387]
aws_iam_role.jacobs_ecs_role: Refreshing state... [id=jacobs_ecs_role]
aws_ecr_repository.jacobs_repo: Refreshing state... [id=jacobs_repo]
aws_iam_policy.jacobs_lambda_logging: Refreshing state... [id=arn:aws:iam::324816727452:policy/lambda_logging]
aws_iam_user.jacobs_airflow_user: Refreshing state... [id=jacobs_airflow_user]
aws_cloudwatch_event_rule.etl_rule: Refreshing state... [id=python_scheduled_task_prod]
aws_cloudwatch_log_group.aws_ecs_logs_airflow: Refreshing state... [id=jacobs_ecs_logs_airflow]
aws_ssm_parameter.jacobs_ssm_prac_secret: Refreshing state... [id=jacobs_ssm_pg_user]
aws_iam_role.jacobs_lambda_s3_role: Refreshing state... [id=jacobs_lambda_s3_role]
aws_s3_bucket.jyablonski_tf_cicd_bucket: Refreshing state... [id=jyablonski-tf-cicd-bucket]
aws_s3_bucket.jyablonski_unhappy_bucket: Refreshing state... [id=jyablonski-unhappy-bucket]
aws_cloudwatch_log_group.jacobs_lambda_logs: Refreshing state... [id=/aws/lambda/jacobs_lambda_function]
aws_s3_bucket.jyablonski_lambda_bucket: Refreshing state... [id=jyablonski-lambda-bucket]
aws_ssm_parameter.jacobs_ssm_prac_public: Refreshing state... [id=jacobs_ssm_test]
aws_iam_group.jacobs_github_group: Refreshing state... [id=github-ecr-cicd]
aws_ecs_cluster.jacobs_ecs_cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:324816727452:cluster/jacobs_fargate_cluster]
aws_vpc.jacobs_vpc_tf: Refreshing state... [id=vpc-00ef7bc92037b5bf0]
aws_iam_user_policy_attachment.jacobs_terraform_user_attachment: Refreshing state... [id=jacobs-terraform-user-20211211210959483500000001]
aws_ecr_lifecycle_policy.jacobs_repo_policy: Refreshing state... [id=jacobs_repo]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment: Refreshing state... [id=jacobs_airflow_user-20211011013703213600000001]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_cloudwatch_logs: Refreshing state... [id=jacobs_airflow_user-20211230231428753500000001]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_execution: Refreshing state... [id=jacobs_airflow_user-20211018230933480900000001]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_ssm: Refreshing state... [id=jacobs_airflow_user-20211124210309375300000001]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_ecr: Refreshing state... [id=jacobs_airflow_user-20211018231134709200000001]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_ses: Refreshing state... [id=jacobs_airflow_user-20211018230933484100000002]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_s3: Refreshing state... [id=jacobs_airflow_user-20211107232055534100000001]
aws_iam_group_policy_attachment.jacobs_github_group_policy_attach: Refreshing state... [id=github-ecr-cicd-20210828175249204100000001]
aws_iam_group_membership.jacobs_github_group_attach: Refreshing state... [id=tf-testing-group-membership]
aws_iam_role_policy_attachment.jacobs_ecs_role_attachment: Refreshing state... [id=jacobs_ecs_role-20210828175249551700000003]
aws_iam_role_policy_attachment.jacobs_ecs_role_attachment_ses: Refreshing state... [id=jacobs_ecs_role-20210904181629178300000001]
aws_iam_role_policy_attachment.jacobs_ecs_role_attachment_s3: Refreshing state... [id=jacobs_ecs_role-20211107185721292100000001]
aws_iam_role_policy_attachment.jacobs_ecs_ecr_role_attachment: Refreshing state... [id=jacobs_ecs_ecr_role-20210828175249545600000002]
aws_iam_role_policy_attachment.jacobs_lambda_s3_role_attachment2: Refreshing state... [id=jacobs_lambda_s3_role-20211115224438866400000002]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=jacobs_lambda_s3_role-20211115225458369200000001]
aws_iam_role_policy_attachment.jacobs_lambda_s3_role_attachment3: Refreshing state... [id=jacobs_lambda_s3_role-20211115224438870600000003]
aws_iam_role_policy_attachment.jacobs_lambda_s3_attachment_4: Refreshing state... [id=jacobs_lambda_s3_role-20211222000709626900000001]
aws_iam_role_policy_attachment.jacobs_lambda_s3_role_attachment1: Refreshing state... [id=jacobs_lambda_s3_role-20211115224438861200000001]
aws_lambda_function.jacobs_s3_lambda_function: Refreshing state... [id=jacobs_lambda_function]
aws_lambda_permission.allow_bucket1: Refreshing state... [id=AllowExecutionFromS3Bucket]
aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=jyablonski-lambda-bucket]
aws_s3_bucket_notification.bucket_notification_jacobsbucket97: Refreshing state... [id=jacobsbucket97]
aws_lambda_permission.allow_bucket_jacobsbucket97: Refreshing state... [id=AllowExecutionFromS3Bucketjacobsbucket97]
aws_subnet.jacobs_public_subnet_2: Refreshing state... [id=subnet-0047afa4a7e93ec89]
aws_internet_gateway.jacobs_gw: Refreshing state... [id=igw-021b87557060ce529]
aws_subnet.jacobs_public_subnet: Refreshing state... [id=subnet-0652b6b91d94ebcd0]
aws_security_group.jacobs_task_security_group_tf: Refreshing state... [id=sg-0e3e9289166404b84]
aws_route_table.jacobs_public_route_table: Refreshing state... [id=rtb-09226b87b7cd35ec8]
aws_ssm_parameter.jacobs_ssm_subnet2: Refreshing state... [id=jacobs_ssm_subnet2]
aws_db_subnet_group.jacobs_subnet_group: Refreshing state... [id=jacobs-subnet-group]
aws_ssm_parameter.jacobs_ssm_subnet1: Refreshing state... [id=jacobs_ssm_subnet1]
aws_ssm_parameter.jacobs_ssm_sg_task: Refreshing state... [id=jacobs_ssm_sg_task]
aws_security_group.jacobs_rds_security_group_tf: Refreshing state... [id=sg-04be859fa9163a50a]
aws_route_table_association.jacobs_public_route: Refreshing state... [id=rtbassoc-0b0bbb75130f63d05]
aws_route_table_association.jacobs_public_route_2: Refreshing state... [id=rtbassoc-0e5a3b38154f8baf6]
aws_db_instance.jacobs_rds_tf: Refreshing state... [id=jacobs-rds-server]
aws_ecs_task_definition.jacobs_ecs_task: Refreshing state... [id=jacobs_task]
aws_ecs_task_definition.jacobs_ecs_task_airflow: Refreshing state... [id=jacobs_task_airflow]
aws_cloudwatch_event_target.ecs_scheduled_task: Refreshing state... [id=python_scheduled_task_prod-jacobs_target_id]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_instance.jacobs_ec2_airflow has changed
  ~ resource "aws_instance" "jacobs_ec2_airflow" {
      ~ associate_public_ip_address          = true -> false
        id                                   = "i-021c31107d920c387"
      ~ instance_state                       = "running" -> "stopped"
      - public_dns                           = "ec2-54-162-149-72.compute-1.amazonaws.com" -> null
      - public_ip                            = "54.162.149.72" -> null
        tags                                 = {
            "Environment" = "Dev"
            "Name"        = "Jacob's EC2 Airflow Server"
        }
        # (25 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # aws_security_group.jacobs_rds_security_group_tf has changed
  ~ resource "aws_security_group" "jacobs_rds_security_group_tf" {
        id                     = "sg-04be859fa9163a50a"
      ~ ingress                = (sensitive)
        name                   = "jacobs_security_group for rds"
        tags                   = {
            "Environment" = "Prod"
            "Name"        = "Jacobs TF Project"
        }
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_instance.jacobs_ec2_airflow will be destroyed
  # (because aws_instance.jacobs_ec2_airflow is not in configuration)
  - resource "aws_instance" "jacobs_ec2_airflow" {
      - ami                                  = "ami-0ed9277fb7eb570c9" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:324816727452:instance/i-021c31107d920c387" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "us-east-1c" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-021c31107d920c387" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "stopped" -> null
      - instance_type                        = "t3a.medium" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "airflow-ec2-key" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-0d401333177664dff" -> null
      - private_dns                          = "ip-10-0-1-62.ec2.internal" -> null
      - private_ip                           = "10.0.1.62" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0652b6b91d94ebcd0" -> null
      - tags                                 = {
          - "Environment" = "Dev"
          - "Name"        = "Jacob's EC2 Airflow Server"
        } -> null
      - tags_all                             = {
          - "Environment" = "Dev"
          - "Name"        = "Jacob's EC2 Airflow Server"
        } -> null
      - tenancy                              = "default" -> null
      - vpc_security_group_ids               = [
          - "sg-0e3e9289166404b84",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0054986c4192d6e40" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_lambda_permission.allow_bucket_jacobsbucket97_sns will be created
  + resource "aws_lambda_permission" "allow_bucket_jacobsbucket97_sns" {
      + action        = "lambda:InvokeFunction"
      + function_name = "arn:aws:lambda:us-east-1:324816727452:function:jacobs_lambda_function"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromS3Bucketjacobsbucket97-sns"
    }

  # aws_lambda_permission.allow_bucket_jacobsbucket97_sqs will be created
  + resource "aws_lambda_permission" "allow_bucket_jacobsbucket97_sqs" {
      + action        = "lambda:InvokeFunction"
      + function_name = "arn:aws:lambda:us-east-1:324816727452:function:jacobs_lambda_function"
      + id            = (known after apply)
      + principal     = "sqs.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromS3Bucketjacobsbucket97-sqs"
    }

  # aws_s3_bucket_notification.bucket_notification_jacobsbucket97_sns will be created
  + resource "aws_s3_bucket_notification" "bucket_notification_jacobsbucket97_sns" {
      + bucket = "jacobsbucket97"
      + id     = (known after apply)

      + topic {
          + events        = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix = "reddit_data/"
          + filter_suffix = ".parquet"
          + id            = (known after apply)
          + topic_arn     = (known after apply)
        }
    }

  # aws_s3_bucket_notification.bucket_notification_jacobsbucket97_sqs will be created
  + resource "aws_s3_bucket_notification" "bucket_notification_jacobsbucket97_sqs" {
      + bucket = "jacobsbucket97"
      + id     = (known after apply)

      + queue {
          + events        = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix = "transactions/"
          + filter_suffix = ".parquet"
          + id            = (known after apply)
          + queue_arn     = (known after apply)
        }
    }

  # aws_security_group.jacobs_rds_security_group_tf will be updated in-place
  ~ resource "aws_security_group" "jacobs_rds_security_group_tf" {
        id                     = "sg-04be859fa9163a50a"
      ~ ingress                = (sensitive)
        name                   = "jacobs_security_group for rds"
        tags                   = {
            "Environment" = "Prod"
            "Name"        = "Jacobs TF Project"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_sns_topic.jacobs_sns_topic will be created
  + resource "aws_sns_topic" "jacobs_sns_topic" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "jacobs-first-sns-topic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "SNS:Publish"
                      + Condition = {
                          + ArnLike = {
                              + aws:SourceArn = "arn:aws:s3:::jacobsbucket97"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "s3.amazonaws.com"
                        }
                      + Resource  = "arn:aws:sns:*:*:s3-event-notification-topic"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                        = {
          + "Environment" = "Prod"
          + "Name"        = "Jacobs TF Project"
        }
      + tags_all                    = {
          + "Environment" = "Prod"
          + "Name"        = "Jacobs TF Project"
        }
    }

  # aws_sns_topic_subscription.lambda will be created
  + resource "aws_sns_topic_subscription" "lambda" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:lambda:us-east-1:324816727452:function:jacobs_lambda_function"
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sqs_queue.jacobs_sqs_queue will be created
  + resource "aws_sqs_queue" "jacobs_sqs_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 30
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "jacobs-first-sqs"
      + name_prefix                       = (known after apply)
      + policy                            = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sqs:SendMessage"
                      + Condition = {
                          + ArnEquals = {
                              + aws:SourceArn = "arn:aws:s3:::jacobsbucket97"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:sqs:*:*:s3-event-notification-queue"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + receive_wait_time_seconds         = 0
      + tags                              = {
          + "Environment" = "Prod"
          + "Name"        = "Jacobs TF Project"
        }
      + tags_all                          = {
          + "Environment" = "Prod"
          + "Name"        = "Jacobs TF Project"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

Plan: 7 to add, 1 to change, 1 to destroy.


```
</details>
*Pusher: @jyablonski, Action: `pull_request`*